## Plan Result (stg_landing)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 39 to add, 7 to change, 11 to destroy.</code></pre>

* Create
  * module.data_landing_zone[&#34;00&#34;].azurerm_data_factory_integration_runtime_self_hosted.this
  * module.data_landing_zone[&#34;00&#34;].module.runtimes_datafactory.azurerm_data_factory.this
  * module.data_landing_zone[&#34;00&#34;].module.runtimes_datafactory.azurerm_data_factory_integration_runtime_azure.this
  * module.data_landing_zone[&#34;00&#34;].module.runtimes_datafactory.azurerm_data_factory_managed_private_endpoint.dependants[&#34;purview-storage-blob&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.runtimes_datafactory.azurerm_data_factory_managed_private_endpoint.dependants[&#34;purview-storage-queue&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.runtimes_datafactory.azurerm_data_factory_managed_private_endpoint.dependants[&#34;purview_eventhub&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.runtimes_datafactory.azurerm_data_factory_managed_private_endpoint.this[&#34;purview&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.runtimes_datafactory.null_resource.private_endpoint_approvals[&#34;purview&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.runtimes_datafactory.null_resource.private_endpoint_approvals[&#34;purview-storage-blob&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.runtimes_datafactory.null_resource.private_endpoint_approvals[&#34;purview-storage-queue&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.runtimes_datafactory.null_resource.private_endpoint_approvals[&#34;purview_eventhub&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.shared_integration_datafactory.azurerm_data_factory.this
  * module.data_landing_zone[&#34;00&#34;].module.shared_integration_datafactory.azurerm_data_factory_integration_runtime_azure.this
  * module.data_landing_zone[&#34;00&#34;].module.shared_integration_datafactory.azurerm_data_factory_linked_service_azure_blob_storage.this[&#34;ingest00curatedstg&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.shared_integration_datafactory.azurerm_data_factory_linked_service_azure_blob_storage.this[&#34;ingest00rawstg&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.shared_integration_datafactory.azurerm_data_factory_linked_service_azure_databricks.this[&#34;ingest00-integration-databricks001-stg&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.shared_integration_datafactory.azurerm_data_factory_linked_service_azure_sql_database.this[&#34;ingest00-metadata-db-stg&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.shared_integration_datafactory.azurerm_data_factory_linked_service_key_vault.this[&#34;ingest00-meta001-stg&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.shared_integration_datafactory.azurerm_data_factory_linked_service_sql_server.this[&#34;ingest00-metadata-mssql-stg&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.shared_integration_datafactory.azurerm_data_factory_managed_private_endpoint.dependants[&#34;purview-storage-blob&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.shared_integration_datafactory.azurerm_data_factory_managed_private_endpoint.dependants[&#34;purview-storage-queue&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.shared_integration_datafactory.azurerm_data_factory_managed_private_endpoint.dependants[&#34;purview_eventhub&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.shared_integration_datafactory.azurerm_data_factory_managed_private_endpoint.this[&#34;keyvault&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.shared_integration_datafactory.azurerm_data_factory_managed_private_endpoint.this[&#34;mssql&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.shared_integration_datafactory.azurerm_data_factory_managed_private_endpoint.this[&#34;purview&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.shared_integration_datafactory.azurerm_data_factory_managed_private_endpoint.this[&#34;storage-curated&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.shared_integration_datafactory.azurerm_data_factory_managed_private_endpoint.this[&#34;storage-raw&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.shared_integration_datafactory.null_resource.private_endpoint_approvals[&#34;purview-storage-queue&#34;]
* Update
  * module.data_landing_zone[&#34;00&#34;].azurerm_synapse_workspace_aad_admin.this
  * module.data_landing_zone[&#34;00&#34;].module.metadata_mssql.azurerm_mssql_database.this[&#34;ingest00-metadata-db-stg&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.networking.azurerm_subnet.this[&#34;vnet-data-bricks-private&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.networking.azurerm_subnet.this[&#34;vnet-data-bricks-product-private&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.networking.azurerm_subnet.this[&#34;vnet-data-bricks-product-public&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.networking.azurerm_subnet.this[&#34;vnet-data-bricks-public&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.shir001.azurerm_virtual_machine_scale_set_extension.shir_install
* Replace
  * module.data_landing_zone[&#34;00&#34;].azurerm_role_assignment.datafactory_databricks
  * module.data_landing_zone[&#34;00&#34;].azurerm_role_assignment.datafactory_storage[&#34;curated&#34;]
  * module.data_landing_zone[&#34;00&#34;].azurerm_role_assignment.datafactory_storage[&#34;raw&#34;]
  * module.data_landing_zone[&#34;00&#34;].azurerm_synapse_workspace.this
  * module.data_landing_zone[&#34;00&#34;].module.runtimes_datafactory.azurerm_private_endpoint.this[&#34;dataFactory&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.runtimes_datafactory.azurerm_private_endpoint.this[&#34;portal&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.shared_integration_datafactory.azurerm_private_endpoint.this[&#34;dataFactory&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.shared_integration_datafactory.azurerm_private_endpoint.this[&#34;portal&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.synapse_pe[&#34;dev&#34;].azurerm_private_endpoint.this
  * module.data_landing_zone[&#34;00&#34;].module.synapse_pe[&#34;sql&#34;].azurerm_private_endpoint.this
  * module.data_landing_zone[&#34;00&#34;].module.synapse_pe[&#34;sqlOnDemand&#34;].azurerm_private_endpoint.this




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.data_landing_zone["00"].azurerm_data_factory_integration_runtime_self_hosted.this will be created
  + resource "azurerm_data_factory_integration_runtime_self_hosted" "this" {
      + data_factory_id             = (known after apply)
      + description                 = "Data Landing Zone - Self Hosted Integration Runtime running on ingest00-shir001"
      + id                          = (known after apply)
      + name                        = "ingest00-runtimes-dataFactory001-shir001"
      + primary_authorization_key   = (known after apply)
      + secondary_authorization_key = (known after apply)
    }

  # module.data_landing_zone["00"].azurerm_role_assignment.datafactory_databricks must be replaced
-/+ resource "azurerm_role_assignment" "datafactory_databricks" {
      ~ id                               = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-shared-integration-stg/providers/Microsoft.Databricks/workspaces/ingest00-integration-databricks001-stg/providers/Microsoft.Authorization/roleAssignments/1cec56cf-d836-8416-4919-806cc8426c2a" -> (known after apply)
      ~ name                             = "1cec56cf-d836-8416-4919-806cc8426c2a" -> (known after apply)
      ~ principal_id                     = "499692d5-2812-4bda-887a-4212f644eaba" # forces replacement -> (known after apply) # forces replacement
      ~ principal_type                   = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/providers/Microsoft.Authorization/roleDefinitions/b24988ac-6180-42a0-ab88-20f7382dd24c" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.data_landing_zone["00"].azurerm_role_assignment.datafactory_storage["curated"] must be replaced
-/+ resource "azurerm_role_assignment" "datafactory_storage" {
      ~ id                               = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-storage-stg/providers/Microsoft.Storage/storageAccounts/ingest00curatedstg/providers/Microsoft.Authorization/roleAssignments/90dae6d0-d3e7-da6f-f9dd-20656f63bf12" -> (known after apply)
      ~ name                             = "90dae6d0-d3e7-da6f-f9dd-20656f63bf12" -> (known after apply)
      ~ principal_id                     = "499692d5-2812-4bda-887a-4212f644eaba" # forces replacement -> (known after apply) # forces replacement
      ~ principal_type                   = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/providers/Microsoft.Authorization/roleDefinitions/ba92f5b4-2d11-453d-a403-e96b0029c9fe" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.data_landing_zone["00"].azurerm_role_assignment.datafactory_storage["raw"] must be replaced
-/+ resource "azurerm_role_assignment" "datafactory_storage" {
      ~ id                               = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-storage-stg/providers/Microsoft.Storage/storageAccounts/ingest00rawstg/providers/Microsoft.Authorization/roleAssignments/97310891-7fd7-39df-efc7-e342e21e713a" -> (known after apply)
      ~ name                             = "97310891-7fd7-39df-efc7-e342e21e713a" -> (known after apply)
      ~ principal_id                     = "499692d5-2812-4bda-887a-4212f644eaba" # forces replacement -> (known after apply) # forces replacement
      ~ principal_type                   = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/providers/Microsoft.Authorization/roleDefinitions/ba92f5b4-2d11-453d-a403-e96b0029c9fe" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.data_landing_zone["00"].azurerm_synapse_workspace.this must be replaced
-/+ resource "azurerm_synapse_workspace" "this" {
      ~ aad_admin                            = [
          - {
              - login     = "DTS Platform Operations"
              - object_id = "e7ea2042-4ced-45dd-8ae3-e051c6551789"
              - tenant_id = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
            },
        ] -> (known after apply)
      ~ connectivity_endpoints               = {
          - "dev"         = "https://ingest00-product-synapse001-stg.dev.azuresynapse.net"
          - "sql"         = "ingest00-product-synapse001-stg.sql.azuresynapse.net"
          - "sqlOnDemand" = "ingest00-product-synapse001-stg-ondemand.sql.azuresynapse.net"
          - "web"         = "https://web.azuresynapse.net?workspace=%2fsubscriptions%2fda8a21e5-d260-4162-9391-6bdadf9103f8%2fresourceGroups%2fingest00-shared-product-stg%2fproviders%2fMicrosoft.Synapse%2fworkspaces%2fingest00-product-synapse001-stg"
        } -> (known after apply)
      ~ id                                   = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-shared-product-stg/providers/Microsoft.Synapse/workspaces/ingest00-product-synapse001-stg" -> (known after apply)
      ~ managed_resource_group_name          = "synapseworkspace-managedrg-77f9716d-3a0e-4e0b-ab07-5587d3e04224" -> (known after apply)
      - managed_virtual_network_enabled      = false -> null
        name                                 = "ingest00-product-synapse001-stg"
      ~ sql_aad_admin                        = [
          - {
              - login     = "DTS Platform Operations"
              - object_id = "e7ea2042-4ced-45dd-8ae3-e051c6551789"
              - tenant_id = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
            },
        ] -> (known after apply)
      - sql_administrator_login              = "sqladminuser" -> null # forces replacement
      - sql_identity_control_enabled         = false -> null
        tags                                 = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
            "businessArea" = "cross-cutting"
            "criticality"  = "High"
            "environment"  = "staging"
        }
        # (4 unchanged attributes hidden)

      ~ identity {
          - identity_ids = [] -> null
          ~ principal_id = "03ead335-5389-479b-853e-402a682a9004" -> (known after apply)
          ~ tenant_id    = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> (known after apply)
            # (1 unchanged attribute hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.data_landing_zone["00"].azurerm_synapse_workspace_aad_admin.this will be updated in-place
  ~ resource "azurerm_synapse_workspace_aad_admin" "this" {
        id                   = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-shared-product-stg/providers/Microsoft.Synapse/workspaces/ingest00-product-synapse001-stg/administrators/activeDirectory"
      ~ synapse_workspace_id = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-shared-product-stg/providers/Microsoft.Synapse/workspaces/ingest00-product-synapse001-stg" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.data_landing_zone["00"].module.metadata_mssql.azurerm_mssql_database.this["ingest00-metadata-db-stg"] will be updated in-place
  ~ resource "azurerm_mssql_database" "this" {
      ~ auto_pause_delay_in_minutes         = 0 -> -1
        id                                  = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-metadata-stg/providers/Microsoft.Sql/servers/ingest00-metadata-mssql-stg/databases/ingest00-metadata-db-stg"
      ~ min_capacity                        = 0 -> 1
        name                                = "ingest00-metadata-db-stg"
        tags                                = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
            "businessArea" = "cross-cutting"
            "criticality"  = "High"
            "environment"  = "staging"
        }
        # (14 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.data_landing_zone["00"].module.networking.azurerm_subnet.this["vnet-data-bricks-private"] will be updated in-place
  ~ resource "azurerm_subnet" "this" {
        id                                             = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-network-stg/providers/Microsoft.Network/virtualNetworks/ingest00-vnet-stg/subnets/ingest00-data-bricks-private-stg"
        name                                           = "ingest00-data-bricks-private-stg"
        # (9 unchanged attributes hidden)

      ~ delegation {
            name = "data-bricks-delegation"

          ~ service_delegation {
              ~ actions = [
                  - "Microsoft.Network/virtualNetworks/subnets/join/action",
                  - "Microsoft.Network/virtualNetworks/subnets/prepareNetworkPolicies/action",
                  - "Microsoft.Network/virtualNetworks/subnets/unprepareNetworkPolicies/action",
                ]
                name    = "Microsoft.Databricks/workspaces"
            }
        }
    }

  # module.data_landing_zone["00"].module.networking.azurerm_subnet.this["vnet-data-bricks-product-private"] will be updated in-place
  ~ resource "azurerm_subnet" "this" {
        id                                             = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-network-stg/providers/Microsoft.Network/virtualNetworks/ingest00-vnet-stg/subnets/ingest00-data-bricks-product-private-stg"
        name                                           = "ingest00-data-bricks-product-private-stg"
        # (9 unchanged attributes hidden)

      ~ delegation {
            name = "data-bricks-delegation"

          ~ service_delegation {
              ~ actions = [
                  - "Microsoft.Network/virtualNetworks/subnets/join/action",
                  - "Microsoft.Network/virtualNetworks/subnets/prepareNetworkPolicies/action",
                  - "Microsoft.Network/virtualNetworks/subnets/unprepareNetworkPolicies/action",
                ]
                name    = "Microsoft.Databricks/workspaces"
            }
        }
    }

  # module.data_landing_zone["00"].module.networking.azurerm_subnet.this["vnet-data-bricks-product-public"] will be updated in-place
  ~ resource "azurerm_subnet" "this" {
        id                                             = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-network-stg/providers/Microsoft.Network/virtualNetworks/ingest00-vnet-stg/subnets/ingest00-data-bricks-product-public-stg"
        name                                           = "ingest00-data-bricks-product-public-stg"
        # (9 unchanged attributes hidden)

      ~ delegation {
            name = "data-bricks-delegation"

          ~ service_delegation {
              ~ actions = [
                  - "Microsoft.Network/virtualNetworks/subnets/join/action",
                  - "Microsoft.Network/virtualNetworks/subnets/prepareNetworkPolicies/action",
                  - "Microsoft.Network/virtualNetworks/subnets/unprepareNetworkPolicies/action",
                ]
                name    = "Microsoft.Databricks/workspaces"
            }
        }
    }

  # module.data_landing_zone["00"].module.networking.azurerm_subnet.this["vnet-data-bricks-public"] will be updated in-place
  ~ resource "azurerm_subnet" "this" {
        id                                             = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-network-stg/providers/Microsoft.Network/virtualNetworks/ingest00-vnet-stg/subnets/ingest00-data-bricks-public-stg"
        name                                           = "ingest00-data-bricks-public-stg"
        # (9 unchanged attributes hidden)

      ~ delegation {
            name = "data-bricks-delegation"

          ~ service_delegation {
              ~ actions = [
                  - "Microsoft.Network/virtualNetworks/subnets/join/action",
                  - "Microsoft.Network/virtualNetworks/subnets/prepareNetworkPolicies/action",
                  - "Microsoft.Network/virtualNetworks/subnets/unprepareNetworkPolicies/action",
                ]
                name    = "Microsoft.Databricks/workspaces"
            }
        }
    }

  # module.data_landing_zone["00"].module.runtimes_datafactory.azurerm_data_factory.this will be created
  + resource "azurerm_data_factory" "this" {
      + id                              = (known after apply)
      + location                        = "uksouth"
      + managed_virtual_network_enabled = true
      + name                            = "ingest00-runtimes-dataFactory001-stg"
      + public_network_enabled          = false
      + purview_id                      = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest-mgmt-rg-stg/providers/Microsoft.Purview/accounts/ingest-mgmt-purview-stg"
      + resource_group_name             = "ingest00-runtimes-stg"
      + tags                            = {
          + "application"  = "dlrm-data-ingest"
          + "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
          + "businessArea" = "cross-cutting"
          + "criticality"  = "High"
          + "environment"  = "staging"
        }

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }
    }

  # module.data_landing_zone["00"].module.runtimes_datafactory.azurerm_data_factory_integration_runtime_azure.this will be created
  + resource "azurerm_data_factory_integration_runtime_azure" "this" {
      + cleanup_enabled         = (known after apply)
      + compute_type            = "General"
      + core_count              = 8
      + data_factory_id         = (known after apply)
      + id                      = (known after apply)
      + location                = "autoresolve"
      + name                    = "AutoResolveIntegrationRuntime"
      + time_to_live_min        = 0
      + virtual_network_enabled = true
    }

  # module.data_landing_zone["00"].module.runtimes_datafactory.azurerm_data_factory_managed_private_endpoint.dependants["purview-storage-blob"] will be created
  + resource "azurerm_data_factory_managed_private_endpoint" "dependants" {
      + data_factory_id    = (known after apply)
      + fqdns              = (known after apply)
      + id                 = (known after apply)
      + name               = "ingest00-runtimes-dataFactory001-purview-storage-blob-stg"
      + subresource_name   = "blob"
      + target_resource_id = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest-mgmt-purview-stg/providers/Microsoft.Storage/storageAccounts/scanuksouthjvoivnx"
    }

  # module.data_landing_zone["00"].module.runtimes_datafactory.azurerm_data_factory_managed_private_endpoint.dependants["purview-storage-queue"] will be created
  + resource "azurerm_data_factory_managed_private_endpoint" "dependants" {
      + data_factory_id    = (known after apply)
      + fqdns              = (known after apply)
      + id                 = (known after apply)
      + name               = "ingest00-runtimes-dataFactory001-purview-storage-queue-stg"
      + subresource_name   = "queue"
      + target_resource_id = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest-mgmt-purview-stg/providers/Microsoft.Storage/storageAccounts/scanuksouthjvoivnx"
    }

  # module.data_landing_zone["00"].module.runtimes_datafactory.azurerm_data_factory_managed_private_endpoint.dependants["purview_eventhub"] will be created
  + resource "azurerm_data_factory_managed_private_endpoint" "dependants" {
      + data_factory_id    = (known after apply)
      + fqdns              = (known after apply)
      + id                 = (known after apply)
      + name               = "ingest00-runtimes-dataFactory001-purview_eventhub-stg"
      + subresource_name   = "namespace"
      + target_resource_id = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest-mgmt-purview-stg/providers/Microsoft.EventHub/namespaces/Atlas-29d1f0ea-be32-44a6-81aa-3dc42e7b18bb"
    }

  # module.data_landing_zone["00"].module.runtimes_datafactory.azurerm_data_factory_managed_private_endpoint.this["purview"] will be created
  + resource "azurerm_data_factory_managed_private_endpoint" "this" {
      + data_factory_id    = (known after apply)
      + fqdns              = (known after apply)
      + id                 = (known after apply)
      + name               = "ingest00-runtimes-dataFactory001-purview-stg"
      + subresource_name   = "account"
      + target_resource_id = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest-mgmt-rg-stg/providers/Microsoft.Purview/accounts/ingest-mgmt-purview-stg"
    }

  # module.data_landing_zone["00"].module.runtimes_datafactory.azurerm_private_endpoint.this["dataFactory"] must be replaced
-/+ resource "azurerm_private_endpoint" "this" {
      ~ custom_dns_configs       = [] -> (known after apply)
      ~ id                       = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-runtimes-stg/providers/Microsoft.Network/privateEndpoints/ingest00-runtimes-dataFactory001-dataFactory-stg" -> (known after apply)
        name                     = "ingest00-runtimes-dataFactory001-dataFactory-stg"
      ~ network_interface        = [
          - {
              - id   = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-runtimes-stg/providers/Microsoft.Network/networkInterfaces/ingest00-runtimes-dataFactory001-dataFactor.nic.8dcb20f3-8183-49a9-99f1-046aecae8861"
              - name = "ingest00-runtimes-dataFactory001-dataFactor.nic.8dcb20f3-8183-49a9-99f1-046aecae8861"
            },
        ] -> (known after apply)
      ~ private_dns_zone_configs = [
          - {
              - id                  = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-runtimes-stg/providers/Microsoft.Network/privateEndpoints/ingest00-runtimes-dataFactory001-dataFactory-stg/privateDnsZoneGroups/endpoint-dnszonegroup/privateDnsZoneConfigs/privatelink.datafactory.azure.net"
              - name                = "privatelink.datafactory.azure.net"
              - private_dns_zone_id = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.datafactory.azure.net"
              - record_sets         = [
                  - {
                      - fqdn         = "ingest00-runtimes-datafactory001-stg.uksouth.privatelink.datafactory.azure.net"
                      - ip_addresses = [
                          - "10.247.10.8",
                        ]
                      - name         = "ingest00-runtimes-datafactory001-stg.uksouth"
                      - ttl          = 10
                      - type         = "A"
                    },
                ]
            },
        ] -> (known after apply)
        tags                     = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
            "businessArea" = "cross-cutting"
            "criticality"  = "High"
            "environment"  = "staging"
        }
        # (3 unchanged attributes hidden)

      ~ private_dns_zone_group {
          ~ id                   = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-runtimes-stg/providers/Microsoft.Network/privateEndpoints/ingest00-runtimes-dataFactory001-dataFactory-stg/privateDnsZoneGroups/endpoint-dnszonegroup" -> (known after apply)
            name                 = "endpoint-dnszonegroup"
            # (1 unchanged attribute hidden)
        }

      ~ private_service_connection {
            name                           = "ingest00-runtimes-dataFactory001-stg"
          ~ private_connection_resource_id = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-runtimes-stg/providers/Microsoft.DataFactory/factories/ingest00-runtimes-dataFactory001-stg" # forces replacement -> (known after apply) # forces replacement
          ~ private_ip_address             = "10.247.10.8" -> (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # module.data_landing_zone["00"].module.runtimes_datafactory.azurerm_private_endpoint.this["portal"] must be replaced
-/+ resource "azurerm_private_endpoint" "this" {
      ~ custom_dns_configs       = [] -> (known after apply)
      ~ id                       = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-runtimes-stg/providers/Microsoft.Network/privateEndpoints/ingest00-runtimes-dataFactory001-portal-stg" -> (known after apply)
        name                     = "ingest00-runtimes-dataFactory001-portal-stg"
      ~ network_interface        = [
          - {
              - id   = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-runtimes-stg/providers/Microsoft.Network/networkInterfaces/ingest00-runtimes-dataFactory001-portal-stg.nic.c66db4c3-772e-49e7-b844-7f06b46698ed"
              - name = "ingest00-runtimes-dataFactory001-portal-stg.nic.c66db4c3-772e-49e7-b844-7f06b46698ed"
            },
        ] -> (known after apply)
      ~ private_dns_zone_configs = [
          - {
              - id                  = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-runtimes-stg/providers/Microsoft.Network/privateEndpoints/ingest00-runtimes-dataFactory001-portal-stg/privateDnsZoneGroups/endpoint-dnszonegroup/privateDnsZoneConfigs/privatelink.adf.azure.com"
              - name                = "privatelink.adf.azure.com"
              - private_dns_zone_id = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.adf.azure.com"
              - record_sets         = [
                  - {
                      - fqdn         = "portal.privatelink.adf.azure.com"
                      - ip_addresses = [
                          - "10.247.10.7",
                        ]
                      - name         = "portal"
                      - ttl          = 10
                      - type         = "A"
                    },
                ]
            },
        ] -> (known after apply)
        tags                     = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
            "businessArea" = "cross-cutting"
            "criticality"  = "High"
            "environment"  = "staging"
        }
        # (3 unchanged attributes hidden)

      ~ private_dns_zone_group {
          ~ id                   = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-runtimes-stg/providers/Microsoft.Network/privateEndpoints/ingest00-runtimes-dataFactory001-portal-stg/privateDnsZoneGroups/endpoint-dnszonegroup" -> (known after apply)
            name                 = "endpoint-dnszonegroup"
            # (1 unchanged attribute hidden)
        }

      ~ private_service_connection {
            name                           = "ingest00-runtimes-dataFactory001-stg"
          ~ private_connection_resource_id = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-runtimes-stg/providers/Microsoft.DataFactory/factories/ingest00-runtimes-dataFactory001-stg" # forces replacement -> (known after apply) # forces replacement
          ~ private_ip_address             = "10.247.10.7" -> (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # module.data_landing_zone["00"].module.runtimes_datafactory.null_resource.private_endpoint_approvals["purview"] will be created
  + resource "null_resource" "private_endpoint_approvals" {
      + id = (known after apply)
    }

  # module.data_landing_zone["00"].module.runtimes_datafactory.null_resource.private_endpoint_approvals["purview-storage-blob"] will be created
  + resource "null_resource" "private_endpoint_approvals" {
      + id = (known after apply)
    }

  # module.data_landing_zone["00"].module.runtimes_datafactory.null_resource.private_endpoint_approvals["purview-storage-queue"] will be created
  + resource "null_resource" "private_endpoint_approvals" {
      + id = (known after apply)
    }

  # module.data_landing_zone["00"].module.runtimes_datafactory.null_resource.private_endpoint_approvals["purview_eventhub"] will be created
  + resource "null_resource" "private_endpoint_approvals" {
      + id = (known after apply)
    }

  # module.data_landing_zone["00"].module.shared_integration_datafactory.azurerm_data_factory.this will be created
  + resource "azurerm_data_factory" "this" {
      + id                              = (known after apply)
      + location                        = "uksouth"
      + managed_virtual_network_enabled = true
      + name                            = "ingest00-integration-dataFactory001-stg"
      + public_network_enabled          = false
      + purview_id                      = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest-mgmt-rg-stg/providers/Microsoft.Purview/accounts/ingest-mgmt-purview-stg"
      + resource_group_name             = "ingest00-shared-integration-stg"
      + tags                            = {
          + "application"  = "dlrm-data-ingest"
          + "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
          + "businessArea" = "cross-cutting"
          + "criticality"  = "High"
          + "environment"  = "staging"
        }

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }
    }

  # module.data_landing_zone["00"].module.shared_integration_datafactory.azurerm_data_factory_integration_runtime_azure.this will be created
  + resource "azurerm_data_factory_integration_runtime_azure" "this" {
      + cleanup_enabled         = (known after apply)
      + compute_type            = "General"
      + core_count              = 8
      + data_factory_id         = (known after apply)
      + id                      = (known after apply)
      + location                = "autoresolve"
      + name                    = "AutoResolveIntegrationRuntime"
      + time_to_live_min        = 0
      + virtual_network_enabled = true
    }

  # module.data_landing_zone["00"].module.shared_integration_datafactory.azurerm_data_factory_linked_service_azure_blob_storage.this["ingest00curatedstg"] will be created
  + resource "azurerm_data_factory_linked_service_azure_blob_storage" "this" {
      + data_factory_id          = (known after apply)
      + id                       = (known after apply)
      + integration_runtime_name = "AutoResolveIntegrationRuntime"
      + name                     = "ingest00curatedstg"
      + service_endpoint         = (sensitive value)
      + use_managed_identity     = true
    }

  # module.data_landing_zone["00"].module.shared_integration_datafactory.azurerm_data_factory_linked_service_azure_blob_storage.this["ingest00rawstg"] will be created
  + resource "azurerm_data_factory_linked_service_azure_blob_storage" "this" {
      + data_factory_id          = (known after apply)
      + id                       = (known after apply)
      + integration_runtime_name = "AutoResolveIntegrationRuntime"
      + name                     = "ingest00rawstg"
      + service_endpoint         = (sensitive value)
      + use_managed_identity     = true
    }

  # module.data_landing_zone["00"].module.shared_integration_datafactory.azurerm_data_factory_linked_service_azure_databricks.this["ingest00-integration-databricks001-stg"] will be created
  + resource "azurerm_data_factory_linked_service_azure_databricks" "this" {
      + adb_domain                 = "https://adb-3901590410596635.15.azuredatabricks.net"
      + data_factory_id            = (known after apply)
      + id                         = (known after apply)
      + integration_runtime_name   = "AutoResolveIntegrationRuntime"
      + msi_work_space_resource_id = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-shared-integration-stg/providers/Microsoft.Databricks/workspaces/ingest00-integration-databricks001-stg"
      + name                       = "ingest00-integration-databricks001-stg"

      + new_cluster_config {
          + cluster_version             = "7.3.x-scala2.12"
          + custom_tags                 = {
              + "application"  = "dlrm-data-ingest"
              + "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
              + "businessArea" = "cross-cutting"
              + "criticality"  = "High"
              + "environment"  = "staging"
            }
          + driver_node_type            = "Standard_DS3_v2"
          + max_number_of_workers       = 15
          + min_number_of_workers       = 1
          + node_type                   = "Standard_DS3_v2"
          + spark_environment_variables = {
              + "PYSPARK_PYTHON" = "/databricks/python3/bin/python3"
            }
        }
    }

  # module.data_landing_zone["00"].module.shared_integration_datafactory.azurerm_data_factory_linked_service_azure_sql_database.this["ingest00-metadata-db-stg"] will be created
  + resource "azurerm_data_factory_linked_service_azure_sql_database" "this" {
      + connection_string        = "Integrated Security=False;Encrypt=True;Connection Timeout=30;Data Source=ingest00-metadata-mssql-stg.database.windows.net;Initial Catalog=ingest00-metadata-db-stg"
      + data_factory_id          = (known after apply)
      + id                       = (known after apply)
      + integration_runtime_name = "AutoResolveIntegrationRuntime"
      + name                     = "ingest00-metadata-db-stg"
      + use_managed_identity     = true
    }

  # module.data_landing_zone["00"].module.shared_integration_datafactory.azurerm_data_factory_linked_service_key_vault.this["ingest00-meta001-stg"] will be created
  + resource "azurerm_data_factory_linked_service_key_vault" "this" {
      + data_factory_id          = (known after apply)
      + id                       = (known after apply)
      + integration_runtime_name = "AutoResolveIntegrationRuntime"
      + key_vault_id             = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-metadata-stg/providers/Microsoft.KeyVault/vaults/ingest00-meta001-stg"
      + name                     = "ingest00-meta001-stg"
    }

  # module.data_landing_zone["00"].module.shared_integration_datafactory.azurerm_data_factory_linked_service_sql_server.this["ingest00-metadata-mssql-stg"] will be created
  + resource "azurerm_data_factory_linked_service_sql_server" "this" {
      + connection_string        = "Integrated Security=False;Encrypt=True;Connection Timeout=30;Data Source=ingest00-metadata-mssql-stg.database.windows.net"
      + data_factory_id          = (known after apply)
      + id                       = (known after apply)
      + integration_runtime_name = "AutoResolveIntegrationRuntime"
      + name                     = "ingest00-metadata-mssql-stg"
    }

  # module.data_landing_zone["00"].module.shared_integration_datafactory.azurerm_data_factory_managed_private_endpoint.dependants["purview-storage-blob"] will be created
  + resource "azurerm_data_factory_managed_private_endpoint" "dependants" {
      + data_factory_id    = (known after apply)
      + fqdns              = (known after apply)
      + id                 = (known after apply)
      + name               = "ingest00-integration-dataFactory001-purview-storage-blob-stg"
      + subresource_name   = "blob"
      + target_resource_id = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest-mgmt-purview-stg/providers/Microsoft.Storage/storageAccounts/scanuksouthjvoivnx"
    }

  # module.data_landing_zone["00"].module.shared_integration_datafactory.azurerm_data_factory_managed_private_endpoint.dependants["purview-storage-queue"] will be created
  + resource "azurerm_data_factory_managed_private_endpoint" "dependants" {
      + data_factory_id    = (known after apply)
      + fqdns              = (known after apply)
      + id                 = (known after apply)
      + name               = "ingest00-integration-dataFactory001-purview-storage-queue-stg"
      + subresource_name   = "queue"
      + target_resource_id = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest-mgmt-purview-stg/providers/Microsoft.Storage/storageAccounts/scanuksouthjvoivnx"
    }

  # module.data_landing_zone["00"].module.shared_integration_datafactory.azurerm_data_factory_managed_private_endpoint.dependants["purview_eventhub"] will be created
  + resource "azurerm_data_factory_managed_private_endpoint" "dependants" {
      + data_factory_id    = (known after apply)
      + fqdns              = (known after apply)
      + id                 = (known after apply)
      + name               = "ingest00-integration-dataFactory001-purview_eventhub-stg"
      + subresource_name   = "namespace"
      + target_resource_id = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest-mgmt-purview-stg/providers/Microsoft.EventHub/namespaces/Atlas-29d1f0ea-be32-44a6-81aa-3dc42e7b18bb"
    }

  # module.data_landing_zone["00"].module.shared_integration_datafactory.azurerm_data_factory_managed_private_endpoint.this["keyvault"] will be created
  + resource "azurerm_data_factory_managed_private_endpoint" "this" {
      + data_factory_id    = (known after apply)
      + fqdns              = (known after apply)
      + id                 = (known after apply)
      + name               = "ingest00-integration-dataFactory001-keyvault-stg"
      + subresource_name   = "vault"
      + target_resource_id = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-metadata-stg/providers/Microsoft.KeyVault/vaults/ingest00-meta001-stg"
    }

  # module.data_landing_zone["00"].module.shared_integration_datafactory.azurerm_data_factory_managed_private_endpoint.this["mssql"] will be created
  + resource "azurerm_data_factory_managed_private_endpoint" "this" {
      + data_factory_id    = (known after apply)
      + fqdns              = (known after apply)
      + id                 = (known after apply)
      + name               = "ingest00-integration-dataFactory001-mssql-stg"
      + subresource_name   = "sqlServer"
      + target_resource_id = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-metadata-stg/providers/Microsoft.Sql/servers/ingest00-metadata-mssql-stg"
    }

  # module.data_landing_zone["00"].module.shared_integration_datafactory.azurerm_data_factory_managed_private_endpoint.this["purview"] will be created
  + resource "azurerm_data_factory_managed_private_endpoint" "this" {
      + data_factory_id    = (known after apply)
      + fqdns              = (known after apply)
      + id                 = (known after apply)
      + name               = "ingest00-integration-dataFactory001-purview-stg"
      + subresource_name   = "account"
      + target_resource_id = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest-mgmt-rg-stg/providers/Microsoft.Purview/accounts/ingest-mgmt-purview-stg"
    }

  # module.data_landing_zone["00"].module.shared_integration_datafactory.azurerm_data_factory_managed_private_endpoint.this["storage-curated"] will be created
  + resource "azurerm_data_factory_managed_private_endpoint" "this" {
      + data_factory_id    = (known after apply)
      + fqdns              = (known after apply)
      + id                 = (known after apply)
      + name               = "ingest00-integration-dataFactory001-storage-curated-stg"
      + subresource_name   = "blob"
      + target_resource_id = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-storage-stg/providers/Microsoft.Storage/storageAccounts/ingest00curatedstg"
    }

  # module.data_landing_zone["00"].module.shared_integration_datafactory.azurerm_data_factory_managed_private_endpoint.this["storage-raw"] will be created
  + resource "azurerm_data_factory_managed_private_endpoint" "this" {
      + data_factory_id    = (known after apply)
      + fqdns              = (known after apply)
      + id                 = (known after apply)
      + name               = "ingest00-integration-dataFactory001-storage-raw-stg"
      + subresource_name   = "blob"
      + target_resource_id = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-storage-stg/providers/Microsoft.Storage/storageAccounts/ingest00rawstg"
    }

  # module.data_landing_zone["00"].module.shared_integration_datafactory.azurerm_private_endpoint.this["dataFactory"] must be replaced
-/+ resource "azurerm_private_endpoint" "this" {
      ~ custom_dns_configs       = [] -> (known after apply)
      ~ id                       = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-shared-integration-stg/providers/Microsoft.Network/privateEndpoints/ingest00-integration-dataFactory001-dataFactory-stg" -> (known after apply)
        name                     = "ingest00-integration-dataFactory001-dataFactory-stg"
      ~ network_interface        = [
          - {
              - id   = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-shared-integration-stg/providers/Microsoft.Network/networkInterfaces/ingest00-integration-dataFactory001-dataFac.nic.334f2089-5ccf-4df9-96ae-a9d96cd47ee5"
              - name = "ingest00-integration-dataFactory001-dataFac.nic.334f2089-5ccf-4df9-96ae-a9d96cd47ee5"
            },
        ] -> (known after apply)
      ~ private_dns_zone_configs = [
          - {
              - id                  = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-shared-integration-stg/providers/Microsoft.Network/privateEndpoints/ingest00-integration-dataFactory001-dataFactory-stg/privateDnsZoneGroups/endpoint-dnszonegroup/privateDnsZoneConfigs/privatelink.datafactory.azure.net"
              - name                = "privatelink.datafactory.azure.net"
              - private_dns_zone_id = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.datafactory.azure.net"
              - record_sets         = [
                  - {
                      - fqdn         = "ingest00-integration-datafactory001-stg.uksouth.privatelink.datafactory.azure.net"
                      - ip_addresses = [
                          - "10.247.10.9",
                        ]
                      - name         = "ingest00-integration-datafactory001-stg.uksouth"
                      - ttl          = 10
                      - type         = "A"
                    },
                ]
            },
        ] -> (known after apply)
        tags                     = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
            "businessArea" = "cross-cutting"
            "criticality"  = "High"
            "environment"  = "staging"
        }
        # (3 unchanged attributes hidden)

      ~ private_dns_zone_group {
          ~ id                   = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-shared-integration-stg/providers/Microsoft.Network/privateEndpoints/ingest00-integration-dataFactory001-dataFactory-stg/privateDnsZoneGroups/endpoint-dnszonegroup" -> (known after apply)
            name                 = "endpoint-dnszonegroup"
            # (1 unchanged attribute hidden)
        }

      ~ private_service_connection {
            name                           = "ingest00-integration-dataFactory001-stg"
          ~ private_connection_resource_id = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-shared-integration-stg/providers/Microsoft.DataFactory/factories/ingest00-integration-dataFactory001-stg" # forces replacement -> (known after apply) # forces replacement
          ~ private_ip_address             = "10.247.10.9" -> (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # module.data_landing_zone["00"].module.shared_integration_datafactory.azurerm_private_endpoint.this["portal"] must be replaced
-/+ resource "azurerm_private_endpoint" "this" {
      ~ custom_dns_configs       = [] -> (known after apply)
      ~ id                       = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-shared-integration-stg/providers/Microsoft.Network/privateEndpoints/ingest00-integration-dataFactory001-portal-stg" -> (known after apply)
        name                     = "ingest00-integration-dataFactory001-portal-stg"
      ~ network_interface        = [
          - {
              - id   = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-shared-integration-stg/providers/Microsoft.Network/networkInterfaces/ingest00-integration-dataFactory001-portal-.nic.00b5d3f4-9f03-4fb8-a2a6-ca098e4bb7e3"
              - name = "ingest00-integration-dataFactory001-portal-.nic.00b5d3f4-9f03-4fb8-a2a6-ca098e4bb7e3"
            },
        ] -> (known after apply)
      ~ private_dns_zone_configs = [
          - {
              - id                  = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-shared-integration-stg/providers/Microsoft.Network/privateEndpoints/ingest00-integration-dataFactory001-portal-stg/privateDnsZoneGroups/endpoint-dnszonegroup/privateDnsZoneConfigs/privatelink.adf.azure.com"
              - name                = "privatelink.adf.azure.com"
              - private_dns_zone_id = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.adf.azure.com"
              - record_sets         = [
                  - {
                      - fqdn         = "portal.privatelink.adf.azure.com"
                      - ip_addresses = [
                          - "10.247.10.12",
                        ]
                      - name         = "portal"
                      - ttl          = 10
                      - type         = "A"
                    },
                ]
            },
        ] -> (known after apply)
        tags                     = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
            "businessArea" = "cross-cutting"
            "criticality"  = "High"
            "environment"  = "staging"
        }
        # (3 unchanged attributes hidden)

      ~ private_dns_zone_group {
          ~ id                   = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-shared-integration-stg/providers/Microsoft.Network/privateEndpoints/ingest00-integration-dataFactory001-portal-stg/privateDnsZoneGroups/endpoint-dnszonegroup" -> (known after apply)
            name                 = "endpoint-dnszonegroup"
            # (1 unchanged attribute hidden)
        }

      ~ private_service_connection {
            name                           = "ingest00-integration-dataFactory001-stg"
          ~ private_connection_resource_id = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-shared-integration-stg/providers/Microsoft.DataFactory/factories/ingest00-integration-dataFactory001-stg" # forces replacement -> (known after apply) # forces replacement
          ~ private_ip_address             = "10.247.10.12" -> (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # module.data_landing_zone["00"].module.shared_integration_datafactory.null_resource.private_endpoint_approvals["purview-storage-queue"] will be created
  + resource "null_resource" "private_endpoint_approvals" {
      + id = (known after apply)
    }

  # module.data_landing_zone["00"].module.shir001.azurerm_virtual_machine_scale_set_extension.shir_install will be updated in-place
  ~ resource "azurerm_virtual_machine_scale_set_extension" "shir_install" {
        id                           = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-runtimes-stg/providers/Microsoft.Compute/virtualMachineScaleSets/ingest00-shir001-vmss/extensions/ingest00-shir001-shir-install"
        name                         = "ingest00-shir001-shir-install"
      ~ settings                     = (sensitive value)
        # (8 unchanged attributes hidden)
    }

  # module.data_landing_zone["00"].module.synapse_pe["dev"].azurerm_private_endpoint.this must be replaced
-/+ resource "azurerm_private_endpoint" "this" {
      ~ custom_dns_configs       = [] -> (known after apply)
      ~ id                       = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-shared-product-stg/providers/Microsoft.Network/privateEndpoints/ingest00-product-synapse001-dev-pe-stg" -> (known after apply)
        name                     = "ingest00-product-synapse001-dev-pe-stg"
      ~ network_interface        = [
          - {
              - id   = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-shared-product-stg/providers/Microsoft.Network/networkInterfaces/ingest00-product-synapse001-dev-pe-stg.nic.5eba88ac-629b-4a2c-996f-c7f79d189490"
              - name = "ingest00-product-synapse001-dev-pe-stg.nic.5eba88ac-629b-4a2c-996f-c7f79d189490"
            },
        ] -> (known after apply)
      ~ private_dns_zone_configs = [
          - {
              - id                  = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-shared-product-stg/providers/Microsoft.Network/privateEndpoints/ingest00-product-synapse001-dev-pe-stg/privateDnsZoneGroups/endpoint-dnszonegroup/privateDnsZoneConfigs/privatelink.dev.azuresynapse.net"
              - name                = "privatelink.dev.azuresynapse.net"
              - private_dns_zone_id = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.dev.azuresynapse.net"
              - record_sets         = [
                  - {
                      - fqdn         = "ingest00-product-synapse001-stg.privatelink.dev.azuresynapse.net"
                      - ip_addresses = [
                          - "10.247.10.24",
                        ]
                      - name         = "ingest00-product-synapse001-stg"
                      - ttl          = 10
                      - type         = "A"
                    },
                ]
            },
        ] -> (known after apply)
        tags                     = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
            "businessArea" = "cross-cutting"
            "criticality"  = "High"
            "environment"  = "staging"
        }
        # (3 unchanged attributes hidden)

      ~ private_dns_zone_group {
          ~ id                   = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-shared-product-stg/providers/Microsoft.Network/privateEndpoints/ingest00-product-synapse001-dev-pe-stg/privateDnsZoneGroups/endpoint-dnszonegroup" -> (known after apply)
            name                 = "endpoint-dnszonegroup"
            # (1 unchanged attribute hidden)
        }

      ~ private_service_connection {
            name                           = "ingest00-product-synapse001-stg"
          ~ private_connection_resource_id = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-shared-product-stg/providers/Microsoft.Synapse/workspaces/ingest00-product-synapse001-stg" # forces replacement -> (known after apply) # forces replacement
          ~ private_ip_address             = "10.247.10.24" -> (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # module.data_landing_zone["00"].module.synapse_pe["sql"].azurerm_private_endpoint.this must be replaced
-/+ resource "azurerm_private_endpoint" "this" {
      ~ custom_dns_configs       = [] -> (known after apply)
      ~ id                       = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-shared-product-stg/providers/Microsoft.Network/privateEndpoints/ingest00-product-synapse001-sql-pe-stg" -> (known after apply)
        name                     = "ingest00-product-synapse001-sql-pe-stg"
      ~ network_interface        = [
          - {
              - id   = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-shared-product-stg/providers/Microsoft.Network/networkInterfaces/ingest00-product-synapse001-sql-pe-stg.nic.6e0bc4cd-38f9-4bfc-affd-37abd363c4a2"
              - name = "ingest00-product-synapse001-sql-pe-stg.nic.6e0bc4cd-38f9-4bfc-affd-37abd363c4a2"
            },
        ] -> (known after apply)
      ~ private_dns_zone_configs = [
          - {
              - id                  = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-shared-product-stg/providers/Microsoft.Network/privateEndpoints/ingest00-product-synapse001-sql-pe-stg/privateDnsZoneGroups/endpoint-dnszonegroup/privateDnsZoneConfigs/privatelink.sql.azuresynapse.net"
              - name                = "privatelink.sql.azuresynapse.net"
              - private_dns_zone_id = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.sql.azuresynapse.net"
              - record_sets         = [
                  - {
                      - fqdn         = "ingest00-product-synapse001-stg.privatelink.sql.azuresynapse.net"
                      - ip_addresses = [
                          - "10.247.10.25",
                        ]
                      - name         = "ingest00-product-synapse001-stg"
                      - ttl          = 10
                      - type         = "A"
                    },
                ]
            },
        ] -> (known after apply)
        tags                     = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
            "businessArea" = "cross-cutting"
            "criticality"  = "High"
            "environment"  = "staging"
        }
        # (3 unchanged attributes hidden)

      ~ private_dns_zone_group {
          ~ id                   = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-shared-product-stg/providers/Microsoft.Network/privateEndpoints/ingest00-product-synapse001-sql-pe-stg/privateDnsZoneGroups/endpoint-dnszonegroup" -> (known after apply)
            name                 = "endpoint-dnszonegroup"
            # (1 unchanged attribute hidden)
        }

      ~ private_service_connection {
            name                           = "ingest00-product-synapse001-stg"
          ~ private_connection_resource_id = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-shared-product-stg/providers/Microsoft.Synapse/workspaces/ingest00-product-synapse001-stg" # forces replacement -> (known after apply) # forces replacement
          ~ private_ip_address             = "10.247.10.25" -> (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # module.data_landing_zone["00"].module.synapse_pe["sqlOnDemand"].azurerm_private_endpoint.this must be replaced
-/+ resource "azurerm_private_endpoint" "this" {
      ~ custom_dns_configs       = [] -> (known after apply)
      ~ id                       = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-shared-product-stg/providers/Microsoft.Network/privateEndpoints/ingest00-product-synapse001-sqlOnDemand-pe-stg" -> (known after apply)
        name                     = "ingest00-product-synapse001-sqlOnDemand-pe-stg"
      ~ network_interface        = [
          - {
              - id   = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-shared-product-stg/providers/Microsoft.Network/networkInterfaces/ingest00-product-synapse001-sqlOnDemand-pe-.nic.0969b9a6-c893-4938-8d73-8b87ae78dfac"
              - name = "ingest00-product-synapse001-sqlOnDemand-pe-.nic.0969b9a6-c893-4938-8d73-8b87ae78dfac"
            },
        ] -> (known after apply)
      ~ private_dns_zone_configs = [
          - {
              - id                  = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-shared-product-stg/providers/Microsoft.Network/privateEndpoints/ingest00-product-synapse001-sqlOnDemand-pe-stg/privateDnsZoneGroups/endpoint-dnszonegroup/privateDnsZoneConfigs/privatelink.sql.azuresynapse.net"
              - name                = "privatelink.sql.azuresynapse.net"
              - private_dns_zone_id = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.sql.azuresynapse.net"
              - record_sets         = [
                  - {
                      - fqdn         = "ingest00-product-synapse001-stg-ondemand.privatelink.sql.azuresynapse.net"
                      - ip_addresses = [
                          - "10.247.10.26",
                        ]
                      - name         = "ingest00-product-synapse001-stg-ondemand"
                      - ttl          = 10
                      - type         = "A"
                    },
                ]
            },
        ] -> (known after apply)
        tags                     = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
            "businessArea" = "cross-cutting"
            "criticality"  = "High"
            "environment"  = "staging"
        }
        # (3 unchanged attributes hidden)

      ~ private_dns_zone_group {
          ~ id                   = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-shared-product-stg/providers/Microsoft.Network/privateEndpoints/ingest00-product-synapse001-sqlOnDemand-pe-stg/privateDnsZoneGroups/endpoint-dnszonegroup" -> (known after apply)
            name                 = "endpoint-dnszonegroup"
            # (1 unchanged attribute hidden)
        }

      ~ private_service_connection {
            name                           = "ingest00-product-synapse001-stg"
          ~ private_connection_resource_id = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-shared-product-stg/providers/Microsoft.Synapse/workspaces/ingest00-product-synapse001-stg" # forces replacement -> (known after apply) # forces replacement
          ~ private_ip_address             = "10.247.10.26" -> (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

Plan: 39 to add, 7 to change, 11 to destroy.
```

</details>



<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.data_landing_zone["00"].azurerm_data_factory_integration_runtime_self_hosted.this has been deleted
  - resource "azurerm_data_factory_integration_runtime_self_hosted" "this" {
        id                          = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-runtimes-stg/providers/Microsoft.DataFactory/factories/ingest00-runtimes-dataFactory001-stg/integrationruntimes/ingest00-runtimes-dataFactory001-shir001"
        name                        = "ingest00-runtimes-dataFactory001-shir001"
      - primary_authorization_key   = "IR@b486302d-8f9a-492e-9fb4-82cde2930c98@ingest00-runtimes-dataFactory001-stg@ServiceEndpoint=ingest00-runtimes-datafactory001-stg.uksouth.datafactory.azure.net@4HnayDZc1OWA2VbkOSxYNBEbQqnFgNy4UtVZUU9ZPhk=" -> null
        # (3 unchanged attributes hidden)
    }

  # module.data_landing_zone["00"].module.runtimes_datafactory.azurerm_data_factory.this has been deleted
  - resource "azurerm_data_factory" "this" {
      - id                              = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-runtimes-stg/providers/Microsoft.DataFactory/factories/ingest00-runtimes-dataFactory001-stg" -> null
      - name                            = "ingest00-runtimes-dataFactory001-stg" -> null
        tags                            = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
            "businessArea" = "cross-cutting"
            "criticality"  = "High"
            "environment"  = "staging"
        }
        # (5 unchanged attributes hidden)

      - identity {
          - identity_ids = [] -> null
          - principal_id = "23dbd43a-354b-4c2b-8aab-ee6259e7962e" -> null
          - tenant_id    = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> null
          - type         = "SystemAssigned" -> null
        }
    }

  # module.data_landing_zone["00"].module.shared_integration_datafactory.azurerm_data_factory.this has been deleted
  - resource "azurerm_data_factory" "this" {
      - id                              = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-shared-integration-stg/providers/Microsoft.DataFactory/factories/ingest00-integration-dataFactory001-stg" -> null
      - name                            = "ingest00-integration-dataFactory001-stg" -> null
        tags                            = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
            "businessArea" = "cross-cutting"
            "criticality"  = "High"
            "environment"  = "staging"
        }
        # (5 unchanged attributes hidden)

      - identity {
          - identity_ids = [] -> null
          - principal_id = "499692d5-2812-4bda-887a-4212f644eaba" -> null
          - tenant_id    = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> null
          - type         = "SystemAssigned" -> null
        }
    }


Unless you have made equivalent changes to your configuration, or ignored the
```

</details>



<!-- github-comment: {"Command":"plan","PRNumber":5,"Program":"tfcmt","SHA1":"","Target":"stg_landing","Vars":{}} -->